---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongFaceSplitterLoopTypesNum
source: html/22aba4fa-7dd6-5901-b359-6e25d4470f97.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.WrongFaceSplitterLoopTypesNum Property

Sketch for splitting the face is invalid. Faces may be split either by a single closed loop that is contained within the face
 or by one or more open loops whose ends lie on the boundary of the face. None of the lines in the sketch are allowed to overlap
 or intersect the boundaries of the face.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongFaceSplitterLoopTypesNum { get; }
```